In [5]:
import pandas as pd

In [2]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [3]:
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [6]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [7]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [8]:
df.loc[[0,2]]

   name  age      job
0  Jone   20  student
2  Nate   30  teacher

In [9]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## by column condition

In [10]:
df[df.age>25]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [11]:
df

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [12]:
df.query('age>20')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [13]:
df[(df.age>25)&(df.name=='Nate')]

   name  age      job
2  Nate   30  teacher

##Filter Column

In [14]:
friend_list = [
    ['john', 20, 'student'],
    ['jenny', 30, 'developer'],
    ['nate', 30, 'teacher'],
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   john  20    student
1  jenny  30  developer
2   nate  30    teacher

In [15]:
df.iloc[:,0:2]

       0   1
0   john  20
1  jenny  30
2   nate  30

In [16]:
df.iloc[0:1,0:2]

      0   1
0  john  20

## by column name

In [17]:
df = pd.read_csv('data/friend_list_no_head.csv', header = None, names=['name','age','job'])

In [18]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [19]:
df_filtered = df[['name','age']]

In [20]:
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [21]:
df.filter(items=['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [22]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [23]:
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [24]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [25]:
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern